# Taps
tap "dopplerhq/cli"
tap "hashicorp/tap"
tap "mongodb/brew"
tap "oven-sh/bun"
tap "shhac/tap"
tap "manaflow-ai/cmux"
tap "withgraphite/tap"

# Core tools
brew "git"
brew "gnupg"
brew "pinentry-mac"
brew "stow"
brew "tmux"
brew "neovim"
brew "zsh"
brew "age"
brew "mas"
brew "coreutils"

# Modern CLI
brew "ripgrep"
brew "jq"
brew "htop"
brew "tealdeer"
brew "glow"
brew "diff-so-fancy"
brew "thefuck"

# Development
brew "uv"
brew "go"
brew "zig"
brew "zls"
brew "protobuf@3"
brew "grpcurl"
brew "envoy"

# Cloud & DevOps
brew "awscli"
brew "aws-vault"
brew "hashicorp/tap/terraform"
brew "dopplerhq/cli/doppler"

# JavaScript / Node
brew "oven-sh/bun/bun"

# Media
brew "ffmpeg"
brew "imagemagick"
brew "optipng"
brew "pngquant"
brew "yt-dlp"

# Utilities
brew "nmap"
brew "qrencode"
brew "upx"
brew "vhs"
brew "pipes-sh"
brew "rig"
brew "librsvg"
brew "python-setuptools"

# GitHub & Git tools
brew "gh"
brew "withgraphite/tap/graphite"
brew "shhac/tap/git-hunk"
brew "shhac/tap/git-wt"
brew "shhac/tap/prtea"
brew "shhac/tap/toss"

# AI agent tools
brew "shhac/tap/agent-mongo"
brew "shhac/tap/agent-notion"
brew "shhac/tap/lin"
brew "agent-browser"

# Other
brew "john-jumbo"
brew "icu4c@76"
brew "presenterm"
brew "postgresql@14"

# Casks
cask "font-fira-code"
cask "gcloud-cli"
cask "maccy"
cask "cmux"

# Mac App Store
mas "Developer", id: 640199958
mas "JumpCloud Password Manager for Safari", id: 6447684706
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "TestFlight", id: 899247664
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835

# Go tools (installed via go install)
go "fyne.io/fyne/v2/cmd/fyne"
go "golang.org/x/tools/gopls"
go "github.com/goreleaser/goreleaser/v2"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/fullstorydev/grpcurl/cmd/grpcurl"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/wailsapp/wails/cmd/wails"
